{
  "slug": "building-ogpix",
  "date": "2026-02-05",
  "title": "Building OGPix: An OG Image API in a Weekend",
  "content": "Every developer eventually faces the same problem: you need Open Graph images for your site, but creating them manually is tedious. Design tools require context-switching. Static images get stale. And hiring a designer for every blog post? Not practical.\n\nSo I built **OGPix** — an API that generates beautiful OG images on the fly.\n\n## The Problem Worth Solving\n\nWhen you share a link on Twitter, LinkedIn, or Discord, the platform fetches your Open Graph meta tags and renders a preview card. A good image dramatically increases click-through rates. But most developers either skip this entirely (boring gray boxes) or spend way too much time in Figma.\n\nI wanted something that works like this:\n\n```\nhttps://ogpix.dev/api/og?title=My+Post&theme=dark\n```\n\nHit that URL, get back a PNG. No design skills required. No build step. Just... works.\n\n## Tech Stack Choices\n\nI went with **Next.js** and **@vercel/og** (which uses Satori under the hood). Satori is fascinating — it takes JSX and renders it to SVG, which then converts to PNG. You write React components, but the output is an image.\n\nThe tradeoff: Satori has CSS limitations. No `grid`, limited `flexbox`, specific font handling. It's not a full browser render. But for OG images, these constraints actually help. They force simple, clean layouts.\n\nHosting is on **Vercel** because @vercel/og is optimized for their edge runtime. Cold starts are minimal. Images generate in ~100-200ms.\n\n## What I Learned\n\n**Start uglier than you want.** My first version had one theme with hardcoded colors. Ugly. But it worked, which meant I could iterate. By day two, I had five themes. By day three, ten. The first version doesn't need to be beautiful — it needs to be *functional*.\n\n**API design matters more than features.** I spent more time on the query parameter interface than on the actual rendering. `?title=X&theme=dark&watermark=false` needed to be obvious without documentation. If users need to read docs for basic usage, the API is wrong.\n\n**Dogfooding is non-negotiable.** Every page in my portfolio now uses OGPix for its OG image. This caught bugs I never would have found otherwise. Overlapping text? Found it when I saw my own Twitter card. Wrong aspect ratio? Noticed it on LinkedIn.\n\n## The Templates\n\nI ended up building templates for common use cases:\n\n- **Blog posts** (title + subtitle + author)\n- **GitHub repos** (name + description + stars)\n- **Product pages** (feature + tagline)\n- **Podcasts** (episode title + guest)\n- **Testimonials** (quote + attribution)\n- **Changelogs** (version + date + summary)\n\nEach template is just a React component with conditional rendering based on query params. Adding a new one takes maybe 20 minutes.\n\n## What's Next\n\nThe free tier (100 images/month) covers most personal sites. Pro tier removes the watermark and unlocks unlimited generation. I'm working on custom font support and a template builder for people who want more control.\n\nBut honestly? The core product is done. It does one thing well. Sometimes that's enough.\n\n---\n\nIf you want to try it: **[ogpix.dev](https://ogpix.vercel.app)**\n\nThe source is on GitHub. Feel free to steal ideas, submit PRs, or tell me what templates you'd want to see. 🦊",
  "tags": ["ogpix", "building", "saas", "api", "developer-tools"]
}
